/*
【问题描述】 打印图案，打印行数从键盘输入。
提示：
先打印上面半个图形，再打印下面半个图形。
嵌套循环使用for循环语句：外层的for语句控制打印的行数，内层的for语句控制每行打印的空格和字符。打印好1行要换行。
注意：每行打印的空格数及字符个数与所在的行号（第1行，第2行....）有关系。
for(  )
{
     for()
     for()
    printf("\n");
}
【输入形式】从键盘输入一个正整数
【输出形式】图案
【样例输入1】
3
【样例输出1】
  *
 ***
*****
 ***
  *
【样例输入2】
 4
【样例输出2】
   *
  ***
 *****
*******
 *****
  ***
   *
【样例说明】*之间无空格。
样例1是当行数为3时打印的图形。样例2是当行数为4时打印的图形。
*/
#include <stdio.h>
int main()
{
    int n, i, j;
    scanf("%d",&n);
    for (i = 1; i <= n; i++)
    {
        for (j = 1; j <= n - i; j++)
            printf(" ");
        for (j = 1; j <= 2 * i - 1; j++)
            printf("*");
        printf("\n");
    }
    for ( i = n - 1; i >= 1; i--)
    {
        for (j = 1; j <= n - i; j++)
            printf(" ");
        for (j = 1; j <= 2 * i - 1; j++)
            printf("*");
        printf("\n");
    }
    return 0;
}
